tests/darcy_04/constant/porousProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      porousProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

absolutePermeabilityModel absolutePermeabilityConst;

absolutePermeabilityConstCoeffs
{
    K0 (
        1e-15 0     0
        0     1e-15 0
        0     0     1e-15
    );
}

geochemistryModel geochemistryNone;

geochemistryNoneCoeffs
{
    eps0 0.2;
}

// ************************************************************************* //
