tests/darcy_04/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application       foamRun;

solver            darcy;

startFrom         latestTime;

startTime         0;

stopAt            endTime;

endTime           1;

deltaT            1;

writeControl      runTime;

writeInterval     1;

purgeWrite        0;

writeFormat       ascii;

writePrecision    10;

writeCompression  off;

timeFormat        general;

timePrecision     6;

runTimeModifiable true;

functions
{
    #includeFunc  graphUniform
}
// ************************************************************************* //
